<?php

$city = ['Братск', 'Владивосток', 'Владимир', 'Железногорск', 'Калуга', 'Курган', 'Минусинск', 'Орёл', 'Суздаль', 'Уссурийск', 'Мурманск', 'Минск'];
$planet = ['Меркурий','Венера', 'Марс', 'Юпитер', 'Сатурн', 'Уран', 'Нептун', 'Плутон', 'Харон', 'Каллисто ', 'Ганимед', 'Церера', 'Ио', 'Титан'  ];
$country =['Албания', 'Австралия', 'Австрия', 'Андорра', 'Барбадос', 'Бельгия', 'Белиз', 'Беларусь', 'Вьетнам', 'Германия', 'Греция', 'Дания', 'Италия', 'Польша', 'Казахстан'];


include 'connection.php';

function addToDB($arr, $category) {
    global $conn;
    foreach ($arr as $item) {
        $conn->query("
            INSERT INTO words(word, category)
            VALUES('$item', '$category')
        ");
    }

    echo 'done';
}

addToDB($country, 'страна');









